import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Name","ResGUID","IsLoop","Volume","PS","ResName"],["","","","","","",""],[1,"绷带物品使用音效","107603",1,2,"使用道具绷带时播放",null],[2,"罐头物品使用音效","107607",1,2,"使用道具牛肉罐头手术包时播放",null],[3,"获得金币音效","107600",1,2,"获得金币时播放",null],[4,"手术包使用音效","107605",1,2,"使用道具手术包时播放",null],[5,"信号弹物品使用音效","107606",1,2,"使用道具信号弹时播放",null],[6,"急救包物品使用音效","107604",1,2,"使用道具急救包时播放",null],[7,"初始营地BGM","107609",0,1,"在初始营地循环播放",null],[8,"途中营地BGM（篝火音效）","20495",0,1,"在篝火存档点附近时播放",null],[9,"中途BGM","107602",0,1,"在途中循环播放（最后部分除外）",null],[10,"途中营地BGM（大营地音效）","107601",0,1,"在大型篝火点附近循环播放",null],[11,"最后登顶冲刺BGM","12721",0,1,"在到达最后一个大营地后播放（持续到山顶）",null],[12,"死亡音效","19641",1,1,"在生命点数减少时播放",null],[13,"跌落音效","107608",1,1,"在跌落损失生命值时播放",null],[14,"刷新存档点音效","13873",1,1,"在存档点刷新时播放",null],[15,"触发事件音效","21076",1,1,"在触发到事件触发器时播放",null],[16,"UI按钮点击音效","39349",1,1,"在点击UI按钮时播放",null],[17,"复活音效","13827",1,1,"在生命点数用完时播放",null],[18,"脚步声","27856",0,1,"在移动时播放",null],[19,"跳跃声","19634",1,1,"在跳跃时播放",null],[20,"开场动画bgm","12721",1,1,"在玩家进入游戏播放展示地图的时候播放",null],[21,"登顶营地的bgm","12721",1,1,"在玩家登顶以后的营地播放",null]];
export interface IAudioElement extends IElementBase{
 	/**q_id*/
	ID:number
	/**名字*/
	Name:string
	/**音频资源*/
	ResGUID:string
	/**是否循环*/
	IsLoop:number
	/**音量大小*/
	Volume:number
	/**备注*/
	PS:string
	/**资源名字*/
	ResName:string
 } 
export class AudioConfig extends ConfigBase<IAudioElement>{
	constructor(){
		super(EXCELDATA);
	}

}